Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_array (Conv2D)         (None, 48, 48, 16)        800       
_________________________________________________________________
batch_normalization_1 (Batch (None, 48, 48, 16)        64        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 48, 48, 16)        12560     
_________________________________________________________________
batch_normalization_2 (Batch (None, 48, 48, 16)        64        
_________________________________________________________________
activation_1 (Activation)    (None, 48, 48, 16)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 24, 24, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 24, 24, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 24, 32)        12832     
_________________________________________________________________
batch_normalization_3 (Batch (None, 24, 24, 32)        128       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 24, 24, 32)        25632     
_________________________________________________________________
batch_normalization_4 (Batch (None, 24, 24, 32)        128       
_________________________________________________________________
activation_2 (Activation)    (None, 24, 24, 32)        0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 12, 12, 32)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 12, 64)        18496     
_________________________________________________________________
batch_normalization_5 (Batch (None, 12, 12, 64)        256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 12, 12, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 12, 12, 64)        0         
_________________________________________________________________
average_pooling2d_3 (Average (None, 6, 6, 64)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 6, 6, 64)          0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 6, 6, 128)         73856     
_________________________________________________________________
batch_normalization_7 (Batch (None, 6, 6, 128)         512       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 6, 6, 128)         147584    
_________________________________________________________________
batch_normalization_8 (Batch (None, 6, 6, 128)         512       
_________________________________________________________________
activation_4 (Activation)    (None, 6, 6, 128)         0         
_________________________________________________________________
average_pooling2d_4 (Average (None, 3, 3, 128)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 3, 128)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 3, 3, 256)         295168    
_________________________________________________________________
batch_normalization_9 (Batch (None, 3, 3, 256)         1024      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 3, 3, 7)           16135     
_________________________________________________________________
global_average_pooling2d_1 ( (None, 7)                 0         
_________________________________________________________________
predictions (Activation)     (None, 7)                 0         
=================================================================
Total params: 642,935
Trainable params: 641,463
Non-trainable params: 1,472
_________________________________________________________________